In [1]:
import sqlite3
import pandas as pd

In [13]:
# df = pd.concat([df,pd.read_clipboard()],ignore_index=True)
# df.shape

(700, 8)

In [14]:
conn = sqlite3.connect(r'./public.db')
def rsq(sql):
    return pd.read_sql(sql, conn)

In [16]:
# df.to_sql('university_professors', conn, if_exists='replace',index=False)

700

In [25]:
rsq("""SELECT table_name 
FROM information_schema.tables
WHERE table_schema = 'public';""")

DatabaseError: Execution failed on sql 'SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'public';': no such table: information_schema.tables

In [24]:
rsq("""-- Query the right table in information_schema

-- Specify the correct table_schema value
SELECT name 
FROM sqlite_master 
WHERE type ='table' AND name NOT LIKE 'sqlite_%';""")

                    name
0  university_professors

In [26]:
rsq("""-- Query the right table in information_schema

-- Specify the correct table_schema value
SELECT * 
FROM sqlite_master """)

,type,name,tbl_name,rootpage,sql
0,table,university_professors,university_professors,2,"CREATE TABLE ""university_professors"" (\n""first..."

In [36]:
print(rsq("""-- Query the right table in information_schema

-- Specify the correct table_schema value
SELECT * 
FROM sqlite_master """)['sql'].values[0])

CREATE TABLE "university_professors" (
"firstname" TEXT,
  "lastname" TEXT,
  "university" TEXT,
  "university_shortname" TEXT,
  "university_city" TEXT,
  "function" TEXT,
  "organization" TEXT,
  "organization_sector" TEXT
)

In [ ]:
# -- Query the right table in information_schema to get columns
# SELECT column_name, data_type 
# FROM information_schema.columns 
# WHERE table_name = 'university_professors' AND table_schema = 'public';

In [23]:
rsq("""-- Query the right table in information_schema to get columns
SELECT *
FROM pragma_table_info('university_professors');""")

   cid                  name  type  notnull dflt_value  pk
0    0             firstname  TEXT        0       None   0
1    1              lastname  TEXT        0       None   0
2    2            university  TEXT        0       None   0
3    3  university_shortname  TEXT        0       None   0
4    4       university_city  TEXT        0       None   0
5    5              function  TEXT        0       None   0
6    6          organization  TEXT        0       None   0
7    7   organization_sector  TEXT        0       None   0

In [18]:
rsq("""-- Query the first five rows of our table
select * 
from  university_professors 
LIMIT 5;""")

,firstname,lastname,university,university_shortname,university_city,function,organization,organization_sector
0,Karl,Aberer,ETH Lausanne,EPF,Lausanne,Chairman of L3S Advisory Board,L3S Advisory Board,Education & research
1,Karl,Aberer,ETH Lausanne,EPF,Lausanne,Member Conseil of Zeno-Karl Schindler Foundation,Zeno-Karl Schindler Foundation,Education & research
2,Karl,Aberer,ETH Lausanne,EPF,Lausanne,Member of Conseil Fondation IDIAP,Fondation IDIAP,Education & research
3,Karl,Aberer,ETH Lausanne,EPF,Lausanne,Panel Member,SNF Ambizione Program,Education & research
4,Reza Shokrollah,Abhari,ETH Zürich,ETH,Zurich,Aufsichtsratsmandat,PNE Wind AG,"Energy, environment & mobility"

In [44]:
rsq("""drop table universities;""")

TypeError: 'NoneType' object is not iterable

In [45]:
rsq("""
CREATE TABLE IF NOT EXISTS universities (
    university_shortname TEXT,
    university TEXT,
    university_city TEXT
);

""")

TypeError: 'NoneType' object is not iterable

In [46]:
rsq("""
-- Print the contents of this table
SELECT * 
FROM universities""")

Empty DataFrame
Columns: [university_shortname, university, university_city]
Index: []

In [ ]:
-- Add the university_shortname column
-- Alter professors to add the text column university_shortname.
ALTER TABLE professors ADD university_shortname TEXT;

-- Print the contents of this table
SELECT * 
FROM professors

In [51]:
rsq("""-- Alter professors to add the text column university_shortname.
-- create the professors table

CREATE TABLE IF NOT EXISTS professors (
    id INTEGER PRIMARY KEY,
    firstname TEXT,
    lastname TEXT,
    university TEXT,
    department TEXT,
    age INTEGER
);
""")

# add the university_shortname column

TypeError: 'NoneType' object is not iterable

In [52]:
rsq("""
ALTER TABLE professors ADD university_shortname TEXT;
""")

TypeError: 'NoneType' object is not iterable

In [53]:
rsq("""-- Print the contents of this table
SELECT * 
FROM professors""")

Empty DataFrame
Columns: [id, firstname, lastname, university, department, age, university_shortname]
Index: []

In [ ]:
-- Rename the organisation column
ALTER TABLE affiliations
RENAME COLUMN organisation TO organization;

-- Delete the university_shortname column
ALTER TABLE affiliations
DROP COLUMN university_shortname;

In [56]:
rsq("""CREATE TABLE affiliations (
    id INTEGER PRIMARY KEY,
    firstname VARCHAR(50) NOT NULL,
    lastname VARCHAR(50) NOT NULL,
    university_shortname VARCHAR(50) NOT NULL,
    function VARCHAR(50),
    organisation VARCHAR(50)
);""")

TypeError: 'NoneType' object is not iterable

In [57]:
rsq("""-- Rename the organisation column
ALTER TABLE affiliations
RENAME COLUMN organisation TO organization;""")

TypeError: 'NoneType' object is not iterable

In [58]:
rsq("""-- Delete the university_shortname column
ALTER TABLE affiliations
DROP COLUMN university_shortname;""")

TypeError: 'NoneType' object is not iterable

In [ ]:
-- Insert unique professors into the new table

INSERT INTO professors (firstname, lastname, university_shortname)  
SELECT DISTINCT firstname, lastname, university_shortname 
FROM university_professors;

-- Doublecheck the contents of new_professors

SELECT * 
FROM professors;

In [62]:
rsq("""-- Insert unique professors into the new table

INSERT INTO professors (firstname, lastname, university_shortname)  
SELECT DISTINCT firstname, lastname, university_shortname 
FROM university_professors;""")

TypeError: 'NoneType' object is not iterable

In [64]:
rsq("""-- Doublecheck the contents of new_professors

SELECT * 
FROM professors;""").head()

,id,firstname,lastname,university,department,age,university_shortname
0,1,Karl,Aberer,None,None,None,EPF
1,2,Reza Shokrollah,Abhari,None,None,None,ETH
2,3,Georges,Abou Jaoudé,None,None,None,EPF
3,4,Hugues,Abriel,None,None,None,UBE
4,5,Daniel,Aebersold,None,None,None,UBE

In [ ]:
-- Insert unique affiliations into the new table
INSERT INTO affiliations(firstname, lastname, function, organization)
SELECT DISTINCT firstname, lastname, function, organization 
FROM university_professors;

-- Doublecheck the contents of affiliations
SELECT * 
FROM affiliations;

In [59]:
rsq("""-- Insert unique affiliations into the new table
INSERT INTO affiliations(firstname, lastname, function, organization)
SELECT DISTINCT firstname, lastname, function, organization 
FROM university_professors;
    """)

TypeError: 'NoneType' object is not iterable

In [61]:
rsq("""-- Doublecheck the contents of affiliations
SELECT * 
FROM affiliations;""").head()

,id,firstname,lastname,function,organization
0,1,Karl,Aberer,Chairman of L3S Advisory Board,L3S Advisory Board
1,2,Karl,Aberer,Member Conseil of Zeno-Karl Schindler Foundation,Zeno-Karl Schindler Foundation
2,3,Karl,Aberer,Member of Conseil Fondation IDIAP,Fondation IDIAP
3,4,Karl,Aberer,Panel Member,SNF Ambizione Program
4,5,Reza Shokrollah,Abhari,Aufsichtsratsmandat,PNE Wind AG

In [69]:
rsq("""-- Insert unique affiliations into the new table
create table if not exists organizations (
    organization text, 
    organization_sector text)

    """)

TypeError: 'NoneType' object is not iterable

In [70]:
rsq("""-- Insert unique affiliations into the new table
INSERT INTO organizations (organization, organization_sector)
SELECT DISTINCT organization, organization_sector
FROM university_professors;
    """)

TypeError: 'NoneType' object is not iterable

In [71]:
rsq("""-- Insert unique affiliations into the new table
SELECT *
FROM organizations;
    """)

,organization,organization_sector
0,L3S Advisory Board,Education & research
1,Zeno-Karl Schindler Foundation,Education & research
2,Fondation IDIAP,Education & research
3,SNF Ambizione Program,Education & research
4,PNE Wind AG,"Energy, environment & mobility"
...,...,...
570,Aeroport Genève,"Energy, environment & mobility"
571,Deutsches Forschungsinstitutes für öffentliche...,Education & research
572,Schweizerische Vereinigung für Führungsausbildung,"Commerce, trade & services"
573,Trust Management Institut e.V.,"Consulting, public relations, legal & trust"
574,BTiO GmbH,"Consulting, public relations, legal & trust"

In [72]:
rsq("""-- Insert unique affiliations into the new table
INSERT INTO universities (university_shortname,university, university_city)
SELECT DISTINCT university_shortname,university, university_city
FROM university_professors;
    """)

TypeError: 'NoneType' object is not iterable

In [73]:
rsq("""select * from universities""")

   university_shortname      university university_city
0                   EPF    ETH Lausanne        Lausanne
1                   ETH      ETH Zürich          Zurich
2                   UBE        Uni Bern            Bern
3                   ULA    Uni Lausanne        Lausanne
4                   USG  Uni St. Gallen    Saint Gallen
5                   UNE   Uni Neuenburg       Neuchâtel
6                   UFR    Uni Freiburg        Fribourg
7                   USI      USI Lugano          Lugano
8                   UBA       Uni Basel           Basel
9                   UGE        Uni Genf          Geneva
10                  UZH      Uni Zürich          Zurich

In [ ]:
# -- Delete the university_professors table
# drop table university_professors;